// --------------------------------------------------------------------------------------------------------------------
// <copyright file="LikeContainer.cs" company="">
//   
// </copyright>
// <summary>
//   Defines the LikeContainer type.
// </summary>
// --------------------------------------------------------------------------------------------------------------------

namespace vkontakte.net.Models
{
    public enum LikeContainer
    {
        //запись на стене пользователя или группы
        post,

        //комментарий к записи на стене	
        comment,   
 
        //фотография
        photo,

        //аудиозапись
        audio,

        //видеозапись
        video,

        //заметка
        note,

        //страница сайта, на котором установлен виджет «Мне нравится»
        sitepage
    }
}